Tracking file by folder pattern:  migrations
[{"model": "datamodel.disease", "pk": 1, "fields": {"diseaseName": "Cercospora leaf spot", "Symptoms": "his disease causes spots on foliage. The circular blemishes typically have an average diameter of 3 millimeters that is between brown and reddish-purple in color, bordering a gray center. However, if spots have just developed, the gray center will not yet be visible. When this fungus experiences favorable conditions, it may progress through 4 or 5 cycles in one season. Each progressive cycle is often more severe than the previous one, with spots sometimes growing to have a diameter of 10 millimeters. As these spots kill the plant cells, leaves will begin to fall from the plant, causing defoliation", "Remedy": "Use the recommended rates of fungicides to control Cercospora leaf spot - do not cut rates. Only one application of Topsin in combination with a protectant fungicide, such as Supertin, should be used during the season. When mixing fungicides, use ¾ of the labeled rate of each fungicide."}}, {"model": "datamodel.disease", "pk": 2, "fields": {"diseaseName": "Brown spot of rice", "Symptoms": "Symptoms appear as lesions (spots) on the coleoptile, leaf blade, leaf sheath, and glumes, being most prominent on the leaf blade and glumes.The disease appears first as minute brown dots, later becoming cylindrical or oval to circular. The several spots coalesce and the leaf dries up.", "Remedy": "Crop rotation,\nAdjustment of planting time\nBalance dose of nitrogenous fertilizer."}}, {"model": "datamodel.disease", "pk": 3, "fields": {"diseaseName": "Rice blast", "Symptoms": "On the leaves, the lesions start as small water soaked bluish green specks, soon enlarge and form characteristic boat shaped spots with grey centre and dark brown margin.The spots join together as the disease progresses and large areas of the leaves dry up and wither. Similar spots are also formed on the sheath.", "Remedy": "Avoid close spacing of seedlings in the main field.\nSpray the main field with Tricyclazole@0.06%."}}, {"model": "datamodel.disease", "pk": 4, "fields": {"diseaseName": "Sheath rot of Rice", "Symptoms": "Small black lesions are formed on the outer leaf sheath near the water line and they enlarge and reach the inner leaf sheath also. The affected tissues rot and abundant sclerotia are seen in the rotting tissues.", "Remedy": "Use recommended doses of fertilizer.\nDeep ploughing in summer and burning of stubbles and infected straw\nDraining off the irrigation water and allow the soil to dry"}}, {"model": "datamodel.disease", "pk": 5, "fields": {"diseaseName": "Algal leaf spot", "Symptoms": "Gray, green or tan raised spots or blotches with green margins on leaves", "Remedy": "Avoid overhead irrigation which can spread the disease; provide adequate space between plants to maximize air circulation around foliage; avoid wounding plants; prune out diseases parts of plants by cutting 6 inches below any visible symptoms; application of appropriate protective fungicides should be made in Spring when old leaves drop from plants"}}, {"model": "datamodel.disease", "pk": 6, "fields": {"diseaseName": "Alternaria leaf spot", "Symptoms": "An infected host will develop a number of lesions on the surface of leaves. Lesions will appear as small circular spots with light brown centers surrounded by dark concentric rings. Spotting is most prevalent on lower, older leaves, but new leaves are susceptible too. Spots that are close together may combine to form one large spot. Heavily spotted leaves will quickly turn yellow, wilt, and fall due to lack of water. Leaves suffer the most from these symptoms, but stems, flowers, and seed pods can all be affected.", "Remedy": "Apply sulfur sprays or copper-based fungicides weekly at first sign of disease to prevent its spread. These organic fungicides will not kill leaf spot, but prevent the spores from germinating. Safely treat most fungal and bacterial diseases with SERENADE Garden."}}, {"model": "datamodel.disease", "pk": 7, "fields": {"diseaseName": "Angular leaf spot", "Symptoms": "Small water-soaked lesions on leaves which expand between leaf veins and become angular in shape; in humid conditions, lesions exude a milky substance which dries to form a white crust on or beside lesions; as the disease progresses, lesions turn tan and may have yellow/green edges; the centers of the lesions dry and may drop out leaving a hole in the leaf", "Remedy": "Use disease-free seed; do not grow plants in field where cucurbits have been grown in the previous 2 years; protective copper spray may help reduce incidence of disease in warm, humid climates; plant resistant varieties"}}, {"model": "datamodel.disease", "pk": 8, "fields": {"diseaseName": "Anthracnose", "Symptoms": "Infected plants develop dark, water soaked lesions on stems, leaves or fruit. The centers of these lesions often become covered with pink, gelatinous masses of spores especially during moist, warm weather.", "Remedy": "Choose resistant plant varieties when possible and use western grown seeds which have not been exposed to the disease.Neem oil spray is an organic, multi-purpose fungicide/insecticide/miticide that kills eggs, larvae and adult stages of insects as well as prevents fungal attack on plants. Apply early, at the first sign of spring budding, every 7-14 days as a preventative measure or on a 7-day schedule until existing problems are eliminated."}}, {"model": "datamodel.disease", "pk": 9, "fields": {"diseaseName": "Aster yellows", "Symptoms": "Foliage turning yellow; secondary shoots begin growing prolifically; stems take on a rigid, upright growth habit; leaves are often small in size and distorted, may appear thickened; flowers are often disfigured and possess conspicuous leafy bracts; fruits are small and pale in color", "Remedy": "Remove any infected plants from the field to reduce spread; control weeds in and around the field that may act as a reservoir for the phytoplasma; protect plants from leaf hopper vectors with row covers"}}, {"model": "datamodel.disease", "pk": 10, "fields": {"diseaseName": "Bacterial fruit blotch", "Symptoms": "extensive chlorosis as well as elongated tan lesions along the leaf veins. Shot-holing of leaves is also commonly observed. Fruit symptoms on pumpkin are similar to those found on melon and include water-soaked areas, cracks in the rind and internal rotting of the fruit.", "Remedy": "use of disease free seed, adequate sanitation, and crop rotation is suggested"}}, {"model": "datamodel.disease", "pk": 11, "fields": {"diseaseName": "Bacterial leaf spot", "Symptoms": "Dark, angular lesions on leaves; leaf lesions may coalesce and cause severely blighted foliage; water-soaked lesions which enlarge and develop into tan scabs, or blisters, on the fruit; blisters eventually flatten as they reach their full size", "Remedy": "Avoid overhead irrigation; rotate crops away from cucurbit species to prevent disease building up; use new seed each planting as saved seed is more likely to carry bacteria; apply appropriate protective fungicides; copper containing fungicides generally provide good control"}}, {"model": "datamodel.disease", "pk": 12, "fields": {"diseaseName": "Bacterial speck", "Symptoms": "Tiny, raised, dark spots, usually with a white border.", "Remedy": "Copper fungicide at first signs of symptoms. ​"}}, {"model": "datamodel.disease", "pk": 13, "fields": {"diseaseName": "Bacterial stalk rot", "Symptoms": "The basal internodes develop soft rot and give a water soaked appearance. A mild sweet fermenting odour accompanies such rotting.\nLeaves some time show signs of wilting or water loss and affected plants within a few days of infection lodge or topple down.\nEars and shank may also show rot. They fail to develop further and the ears hang down simply from the plant", "Remedy": "Use of disease resistance varieties, i.e. Hybrids Ganga Safed-2, DHM 103, show significantly less disease incidence than other hybrids.\nAvoid waterlogging and poor drainage."}}, {"model": "datamodel.disease", "pk": 14, "fields": {"diseaseName": "Bacterial wilt", "Symptoms": "The first symptoms are wilting of the youngest leaves, usually during the hottest part of the day. This can easily go unnoticed because the leaves stay green but eventually the entire plant wilts and dies. These dramatic symptoms occur when the weather is hot (over 85 degrees), the humidity is high and lots of rainfall has left the ground wet. It’s also more common in soil with a high PH.\n\nYou can diagnose bacterial wilt by cutting the stem at the base of the plant. Look for discolored tissue. Suspend the stem in a glass of water. If it is infected, a white, slimy substance will ooze into the water within just a few minutes.", "Remedy": "Running water can spread the disease to other parts of the garden so rotate your crops regularly away from host plants which could include all of the nightshades (tomatoes, peppers and eggplants), flowers including sunflowers and cosmos and potatoes.Try raised beds to improve drainage and control root knot nematodes that weaken plants, leaving them more susceptible to disease.Space plants far enough apart to provide good air circulation.Have your soil tested and maintain a pH of 6.2-6.5, which is ideal for growing tomatoes and many other vegetables.Wash your hands after handling infected plants and sterilize any gardening tool that could have been used in infected soil."}}, {"model": "datamodel.disease", "pk": 15, "fields": {"diseaseName": "Bean mosaic virus", "Symptoms": "Symptoms appear as a green to bluish-green mottled or mosaic pattern on leaves which usually exhibit a downward curling or cupping.", "Remedy": "Rotate the bean crop each year, especially if you have had any infection in the Aphid control is vital to control of bean mosaic virus. Check the underside of the leaves for aphids and, if found, treat immediately with an insecticidal soap or neem oil."}}, {"model": "datamodel.disease", "pk": 16, "fields": {"diseaseName": "Black rust", "Symptoms": "Symptoms are produced on almost all aerial parts of the wheat plant but are most common on stem, leaf sheaths and upper and lower leaf surfaces.\nPustules (containing masses of urediospores) are dark reddish brown - occur on both sides of the leaves, on the stems, and on the spikes.", "Remedy": "Be sure to dispose of these leaves. Do not compost them. Then treat your plantwith a fungicide, such as neem oil. Continue to remove leaves and treat the plantuntil all signs of the plant rust are gone."}}, {"model": "datamodel.disease", "pk": 17, "fields": {"diseaseName": "Blackleg", "Symptoms": "Blackleg fungus commonly affects the stems and leaves.Stem damage can lead to cankering and severing of the plant at the base. The lesions are light brown with a purplish outline which often contain pinhead-sized, black dots. The lesions tend to be linear and irregularly distributed. Wet and windy conditions favour development of the disease.", "Remedy": "You can use fungicides such as Thiram and Captan to treat vegetables infected by blackleg. If the infected crops do not respond to the treatment, uproot and burn or bury them in a dry soil."}}, {"model": "datamodel.disease", "pk": 18, "fields": {"diseaseName": "Blister blight", "Symptoms": "Small, pinhole-size spots on young leaves; spots become transparent, larger, and light brown; blisters on underside of leaves; dark green, water-soaked zones surrounding blisters; blisters may be white and velvety or brown; young stems bent and distorted, may break off or die", "Remedy": "Plant tea varieties which are less susceptible to the disease; apply appropriate foliar or systemic fungicides to protect the plants"}}, {"model": "datamodel.disease", "pk": 19, "fields": {"diseaseName": "Blossom end root", "Symptoms": "Dark brown/black spots develop at the blossom end of the fruit and enlarge as the fruit rots. Management: Generally attributed to a lack of calcium during fruit set. This could be caused by too much high nitrogen fertilizer or uneven watering, resulting in fluctuations of nutrient availability.", "Remedy": "Remove affected fruit and provide regular, deep waterings."}}, {"model": "datamodel.disease", "pk": 20, "fields": {"diseaseName": "Botrytis leaf blight", "Symptoms": "The first symptoms of leaf blight are greyish-white, oval-shaped spots, about 1 to 3 mm in length that appear on the leaves. These spots are often surrounded by a distinctive silvery-white \"halo\" with uneven margins. The centres of many spots become sunken and straw-colored and when numerous, the leaf tips begin to dieback, eventually affecting the entire leaf", "Remedy": "remove cull piles and cull onions from field areas, rogue out volunteer onions and rotate crops."}}, {"model": "datamodel.disease", "pk": 21, "fields": {"diseaseName": "Brown rust", "Symptoms": "The most common site for symptoms is on upper leaf blades, however, sheaths, glumes and awns may occasionally become infected and exhibit symptoms", "Remedy": "Be sure to dispose of these leaves. Do not compost them. Then treat your plantwith a fungicide, such as neem oil. Continue to remove leaves and treat the plantuntil all signs of the plant rust are gone."}}, {"model": "datamodel.disease", "pk": 22, "fields": {"diseaseName": "Buckeye rot", "Symptoms": "Buckeye Rot is similar to Blossom End Rot, except on green fruit. On ripened fruit, the rotting area will appear water-soaked, but not dark in color. The rot develops on the area of the fruit that touches the soil. The spot will enlarge and develop concentric rings that resemble a buckeye. The affected area is smooth, distinguishing it from Late Blight, which has a rough surface.", "Remedy": "Remove affected fruit and keep future fruits from contact with the soil."}}, {"model": "datamodel.disease", "pk": 23, "fields": {"diseaseName": "Bud rot", "Symptoms": "chlorosis", "Remedy": "Remove all affected buds immediately - Carefully remove and discard all buds that have possibly been affected by bud rot. Don't let any rot touch other parts of your plant. This helps prevent bud rot from spreading."}}, {"model": "datamodel.disease", "pk": 24, "fields": {"diseaseName": "Bunchy top", "Symptoms": "sudden browning,yellowing,spotting,withering or death of fruits,flowers,branches or the entire plant", "Remedy": "Remove the crops affected by this virus at the earliest"}}, {"model": "datamodel.disease", "pk": 25, "fields": {"diseaseName": "Camellia flower blight", "Symptoms": "Small, brown, irregular-shaped spots on the flower petals; whole flower turning brown; flowers dropping from plant", "Remedy": "Remove all infected flowers from plants; remove all crop debris from around plants; soil drenches with appropriate fungicides can help to reduce the intensity of the disease"}}, {"model": "datamodel.disease", "pk": 26, "fields": {"diseaseName": "Canker", "Symptoms": "wilting, discoloration of the leaf veins, and lesions on the fruit and stems of the plant.", "Remedy": "You can use a hot water treatment and rotation of crops"}}, {"model": "datamodel.disease", "pk": 27, "fields": {"diseaseName": "Cigar end tip rot", "Symptoms": "Cigar tip rot starts in the flower, moves to the tips of the fruit and turns them black and fibrous.", "Remedy": "Removal of pistil and perianth by hand 8-10 days after bunch formation and spraying the bunch with Dithane M -45 (0.1%) or Topsin M (0.1%) controls the disease effectively."}}, {"model": "datamodel.disease", "pk": 28, "fields": {"diseaseName": "Clubroot", "Symptoms": "Above ground: Stunted growth, purplish foliage and wilting in hotweather, which may recover under wetter conditions. Below ground: The root system becomes massivelyswollen and distorted, with a loss of the finer roots.", "Remedy": "Choose resistant cultivars when possible.\nTry to prevent the occurrence of this disease by keeping a clean garden and rotating crops.Control susceptible weeds — mustard, radish, shepherd’s purse — that may be infected to reduce potential buildup of the disease."}}, {"model": "datamodel.disease", "pk": 29, "fields": {"diseaseName": "Coffee berry", "Symptoms": "Dark sunken lesions on green berries; berries dropping from plant; mummified berries", "Remedy": "Protective sprays of copper containing fungicides can help to control the disease; any diseased berries should be removed from plants; resistant varieties are available and should be planted in areas where disease is present"}}, {"model": "datamodel.disease", "pk": 30, "fields": {"diseaseName": "Collar rot", "Symptoms": "The first symptoms of crown or collar rot may be poor growth, leaf yellowing or premature autumn colours.In the rootstock below ground the presence of typical orange/red-brown rot under the bark is characteristic of crown rot.A water-soaked, weeping area on the trunk which has a distinct orange/red-brown rot under the bark is  characteristic of collar rot.", "Remedy": "trees showing foliar symptoms are usually too badly damaged to save.  These should be grubbed and burnt.The replanted tree and the trees in the rest of the orchard can be treated with the chemical fungicide Cuprokylt (copper oxychloride) or Fubol Gold WG (mancozeb + metalaxyl).Fubol Gold should be applied after harvest, but before green cluster stage.he lesion should be either cut out completely back to sapwood ensuring the cutting passes through the graft union or a groove cut down to the sapwood, surrounding the lesion."}}, {"model": "datamodel.disease", "pk": 31, "fields": {"diseaseName": "Cucumber mosaic", "Symptoms": "Plants are severely stunted; foliage is covered in distinctive yellow mosaic; leaves of plant curl downwards and leaf size is smaller than normal; flowers on infected plants may be deformed with green petals; fruits become distorted and are small in size; fruit is often discolored", "Remedy": "Control of the virus is largely dependant on the control of the aphid vectors; reflective mulches can deter aphid feeding; aphid outbreaks can be treated with mineral oils or insecticidal soap applications; some resistant varieties are available"}}, {"model": "datamodel.disease", "pk": 32, "fields": {"diseaseName": "Downy mildew", "Symptoms": "Angular brown lesions on upper side of leaves; purple to gray spores and gray mold on underside of leaves; brown leaves; dead leaves that remain attached", "Remedy": "Do not overcrowd plants; avoid overhead irrigation, water plants from base; apply appropriate fungicide"}}, {"model": "datamodel.disease", "pk": 33, "fields": {"diseaseName": "Fruit rot", "Symptoms": "Symptoms can range from superficial flecking to brown-black, dry, sunken lesions which may extend into fruit cavities.", "Remedy": "The best treatment for anthracnose is to prevent its occurring in the first place. This can best be achieved by annual rotation of the planting location. Make sure that no non-solanaceous plants such as potatoes, soybeans or peppers were planted in the same soil in the previous year."}}, {"model": "datamodel.disease", "pk": 34, "fields": {"diseaseName": "Grassy shoot", "Symptoms": "The antharacnose attack the foliage and twigs which start drying", "Remedy": "Use of healthy diseased free planting material collected from seed nursery for planting.\n\nRoguing of affected stools and destruction – Mass eradication may help consistent reduction in inoculum in the area."}}, {"model": "datamodel.disease", "pk": 35, "fields": {"diseaseName": "Gray wall", "Symptoms": "The green fruits may have a gray cast or gray blotches. Ripe fruit will have green or brown areas on the inside of the fruit.", "Remedy": "Good growing conditions will prevent gray wall. Make sure plants aren't heavily shaded, are receiving even waterings and fertilizer and that the soil is not compacted around the roots. Cool temperatures and stressed or unhealthy plants also contribute to the problem."}}, {"model": "datamodel.disease", "pk": 36, "fields": {"diseaseName": "Greasy spot fungus", "Symptoms": "The affected plant tissue usually turns brown to black in color", "Remedy": "The best treatment around is to use one of the copper fungicides out there and spray the tree with it. Use the copper fungicide according to directions in order to kill the citrus tree fungus."}}, {"model": "datamodel.disease", "pk": 37, "fields": {"diseaseName": "Gummy stem blight", "Symptoms": "V-shaped yellow to brown areas on stem; cracked dry areas on stem; lesions leaking a sappy material", "Remedy": "Use disease free seed; treat seeds prior to planting; rotate crops every 2 years"}}, {"model": "datamodel.disease", "pk": 38, "fields": {"diseaseName": "Horse hair blight", "Symptoms": "Black threadlike structures resembling horse hair attached to upper branches of plant by small brown discs; leaves drop rapidly from plant", "Remedy": "Remove  and destroy all crop debris from around plants; pluck out infected or dead branches from the plant canopy"}}, {"model": "datamodel.disease", "pk": 39, "fields": {"diseaseName": "Late blight", "Symptoms": "Blackish water soaked lesions occur on the leaves and whitish sporulation of the pathogen can be seen around the margin of the lesions, particularly on the underside of the leaf. On stems, late blight causes brown lesions that look greasy.", "Remedy": "Use potato tubers for seed from disease-free areas to ensure that the pathogen is not carried through seed tuber.\nThe infected plant material in the field should be properly destroyed.\nGrow resistant varieties like Kufri Navtal."}}, {"model": "datamodel.disease", "pk": 40, "fields": {"diseaseName": "Leaf gall", "Symptoms": "Symptoms consisted of gall formation along leaf blades and sheaths, dark green discoloration, twisted leaf tips and reduced numbers of tillers. Some plants died in the glasshouse in later stages of infection", "Remedy": "spray with a miticide to prevent galls on ornamental plants. Horticultural oils and some insecticides will be effective but not after the mites are under the surface of the plant. Don’t use broad spectrum insecticides, which will harm potential predators of the gall mites."}}, {"model": "datamodel.disease", "pk": 41, "fields": {"diseaseName": "Leaf Rot", "Symptoms": "Smut galls ripen and rupture, releasing spores that travel through the air to infect new plants and overwinter in the soil, awaiting future crops", "Remedy": "Apply sulfur sprays or copper-based fungicides weekly at first sign of disease to prevent its spread. These organic fungicides will not kill leaf spot, but prevent the spores from germinating. Safely treat most fungal and bacterial diseases with SERENADE Garden."}}, {"model": "datamodel.disease", "pk": 42, "fields": {"diseaseName": "Onion smut", "Symptoms": "characteristic black streaks and blisters appear in the leaves and small bulbs later in the growing season as the fungus moves from the infected flag leaf to younger leaves", "Remedy": "Seed treatments can reduce losses to the disease and growing onions from transplants avoids the disease."}}, {"model": "datamodel.disease", "pk": 43, "fields": {"diseaseName": "Phytophthora heart rot", "Symptoms": "Powdery, white spots on the undersides of leaves; yellowing leaves", "Remedy": "Rotate crops; plant only disease-free seed; apply appropriate fungicide if disease becomes a problem"}}, {"model": "datamodel.disease", "pk": 44, "fields": {"diseaseName": "Phytophthora root rot", "Symptoms": "Powdery mildew, caused by the fungus Uncinulanecator, can infect all green tissues of the grapevine. Tissues are generally susceptible to infection throughout the growing season. Diseased leaves appear whitish gray, dusty, or have a powdery white appearance. Petioles, cluster stems, and green shoots often look distorted or stunted. Berries can be infected until their sugar content reaches about 8%. If infected when young, the epidermis of the berry can split and the berries dry up or rot.", "Remedy": "Wash the pot thoroughly with a bleach solution. If possible, dip the remaining healthy roots in a fungicide solution to kill off any possible root rot fungus. After treating root rot in the plant, repot the plant in clean potting mix. ... You do not want to have to treat root rot again in the plant"}}, {"model": "datamodel.disease", "pk": 45, "fields": {"diseaseName": "Pierce's disease", "Symptoms": "As the bacteria in the xylem grows, it blocks the water-conducting system. The first thing that may be noticeable is that leaves turn slightly yellow or red on the margins. After this, fruit shrivels and dies, then the leaves fall off the plant. New canes develop irregularly", "Remedy": "vines that have had symptoms for more than a year should be removed during the dormant season. Any vines that are showing foliar symptoms should also be removed. It is imperative that diseased vines be removed as soon as possible when symptoms are first apparent. This will help keep infection spread to a minimal."}}, {"model": "datamodel.disease", "pk": 46, "fields": {"diseaseName": "Powdery mildew", "Symptoms": "Powdery, white spots on the undersides of leaves; yellowing leaves", "Remedy": "Plant in sites with good air circulation and sun exposure; do not overcrowd plants; sanitize equipment regularly"}}, {"model": "datamodel.disease", "pk": 47, "fields": {"diseaseName": "Purple blotch", "Symptoms": "Small brown spots with purplish centres are characteristic of this disease. Under favorable conditions, the spots form into oval lesions that have a purplish tint with concentric rings. Older leaves tend to be more susceptible to the disease.", "Remedy": "Rotate the crops regularly"}}, {"model": "datamodel.disease", "pk": 48, "fields": {"diseaseName": "Red rot", "Symptoms": "Leaves suddenly turning yellow and wilting; branch tips dying; gray blotches on bark and stem which develop into sunken areas (cankers); cankers girdling the stem; parts of plant above cankers losing vigor, wilting and dying; symptoms more pronounced during hot, dry weather", "Remedy": "Cultivation of resistant varieties like Co 89003, Co 98014, Co 0118, Co 0238, Co 0239, Co 0124, etc will contain the disease.\n\nThe disease spread through infected setts. Therefore, always select seed canes from a disease free healthy crop. Any setts showing reddening at the cut ends or at the nodal region should be discarded."}}, {"model": "datamodel.disease", "pk": 49, "fields": {"diseaseName": "Root rot", "Symptoms": "stunting, wilting and discolored leaves. Foliage and shoots die back and the entire plant soon dies. If you pull up a plant with root rot, you will see that the roots are brown and soft instead of firm and white.", "Remedy": "disposing of the soil in the pot that the plant was in. Wash the pot thoroughly with a bleach solution. If possible, dip the remaining healthy roots in a fungicide solution to kill off any possible root rot fungus. After treating root rot in the plant, repot the plant in clean potting mix."}}, {"model": "datamodel.disease", "pk": 50, "fields": {"diseaseName": "Scab", "Symptoms": "Angular brown lesions on leaves confined by small veins; pale green and water soaked lesions; holes in leaves from dried out lesions; lesions may also be present on petioles, stems and fruit", "Remedy": "Rotate cucurbits with non-susceptible crops for a period of at least 2 years; plant only in well-draining soils; spray plants with appropriate protective fungicides"}}, {"model": "datamodel.disease", "pk": 51, "fields": {"diseaseName": "Septoria leaf spot", "Symptoms": "Initial symptoms of disease are small dark water-soaked spots on the leaves which turn beige to white in dry conditions; lesions develop thin brown borders and the centers may become brittle and crack; small white spots may erupt on the surface of infected butternut and acorn squash and pumpkin fruit", "Remedy": "Scout plants during cool wet conditions for any sign of spots; early application of an appropriate protective fungicide can help limit the development of the disease if spots are found' cucurbits should be rotated with other crops every 2 years to prevent the build-up of inoculum; crop debris should be removed and destroyed after harvest"}}, {"model": "datamodel.disease", "pk": 52, "fields": {"diseaseName": "Sheath blight of Rice", "Symptoms": "Initial symptoms of sheath blight are noticed on leaf sheaths near water level. On the leaf sheath oval or elliptical or irregular greenish grey spots are formed.\n\nAs the spots enlarge, the centre becomes greyish white with an irregular blackish brown or purple brown border.\n\nLesions on the upper parts of plants extend rapidly coalescing with each other to cover entire tillers from the water line to the flag leaf.", "Remedy": "Avoid excess doses of fertilizers.\nEliminate weed hosts.\nAvoid flow of irrigation water from infected fields to healthy fields.\nDeep ploughing in summer and burning of stubbles."}}, {"model": "datamodel.disease", "pk": 53, "fields": {"diseaseName": "Smut", "Symptoms": "Smut is a disease of pearl millet grain-bearing heads (inflorescences) that can significantly reduce grain yields, wherever the crop is grown. Infected florets develop as plump sacs or sori, initially green in colour and then turning dark brown or black as the sori mature. The sori are filled with black spores of the causal fungus, hence the name smut.", "Remedy": "Smut is best managed by the use of resistant cultivars."}}, {"model": "datamodel.disease", "pk": 54, "fields": {"diseaseName": "Sooty mold", "Symptoms": "Immature, green sori larger than the seed develop on panicles during grain filling stage. A single sorus develops per floret. As grain matures, sori change in color from bright green to dark brown. Sori are filled with dark teliospores.", "Remedy": "Neem oil is an effective treatment"}}, {"model": "datamodel.disease", "pk": 55, "fields": {"diseaseName": "Southern blight", "Symptoms": "Most frequently, this fungus infects lower stems near or at the soil surface, but it also may infect any part of a susceptible plant as long as favorable environmental conditions exist. The first symptom usually noticed by the homeowner or grower is wilt. Wilted plants often decline and die rapidly as a result of an extensive lower stem rot.", "Remedy": "Remove and destroy diseased plants along with the surrounding soil and any garden debris or mulch that has come in contact with them. Don’t transplant any nearby plants to other parts of the garden."}}, {"model": "datamodel.disease", "pk": 56, "fields": {"diseaseName": "Stem rot", "Symptoms": "staining of infected area, reduced crop yield and crop failure.", "Remedy": "Hot water treatement and rotation of crops regularly are auggested"}}, {"model": "datamodel.disease", "pk": 57, "fields": {"diseaseName": "Sugarcane mosaic", "Symptoms": "Dark sunken lesions on green berries; berries dropping from plant; mummified berries", "Remedy": "There is no cure for this disease and once plants are infected they must be removed from the crop."}}, {"model": "datamodel.disease", "pk": 58, "fields": {"diseaseName": "Tanjore wilt", "Symptoms": "Cream to pink mucilaginous droplets of \"honeydew\" ooze out of infected florets on pearl millet panicles and form sclerotia Within 10 to 15 days, the droplets dry and harden, and dark brown to black sclerotia develop in place of seeds on the panicle.", "Remedy": "Regular basin irrigation during summer months.\nAvoid flood irrigation to prevent the possible spread of the pathogen through soil.\nApply50 kg farmyard manure and 5 kg neem cake per palm per year."}}, {"model": "datamodel.disease", "pk": 59, "fields": {"diseaseName": "Tobacco mosaic", "Symptoms": "mosaic, mottling, necrosis, stunting, leaf curling, and yellowing of plant tissues.", "Remedy": "Remove decaying leaves from the plant and the surrounding soil. Burn all parts of infected plants, never put them on the compost heap and do not dig them into the soil. Wash your hands thoroughly and disinfect all gardening implements after handling infected plants. Regularly inspect plants for signs of TMV infection."}}, {"model": "datamodel.disease", "pk": 60, "fields": {"diseaseName": "Tobacco ring spot", "Symptoms": "stunting of the plant, chlorotic and necrotic spots on the leaves, and stem dieback, chlorotic mottling, line-pattern, mosaic, vein yellowing and leaf curling.", "Remedy": "the use of cultivars resistant are immune to TRSV."}}, {"model": "datamodel.disease", "pk": 61, "fields": {"diseaseName": "Verticillium wilt", "Symptoms": "Symptoms generally appear after fruit set; chlorotic leaves which develop necrotic areas; leaves collapsing; symptoms only on one side of vine; discoloration of vascular tissue in roots", "Remedy": "Do not plant in areas where other susceptible crops have been grown previously; delay planting until temperatures are warmer"}}, {"model": "datamodel.disease", "pk": 62, "fields": {"diseaseName": "Watermelon mosaic", "Symptoms": "Symptoms vary widely depending on species, cultivar, virus strain and environmental conditions; symptoms on leaves may include green mosaic patternation, green vein-banding, chlorotic rings and disfigured leaves", "Remedy": "Treatments that control populations of aphid vectors can also reduce the incidence of the virus; spraying plants with mineral oils or insecticidal soaps can help to reduce aphid numbers"}}, {"model": "datamodel.disease", "pk": 63, "fields": {"diseaseName": "White blister", "Symptoms": "circular areas of light green to yellow discolouration appear on the upper leaf surface, corresponding to white blisters on the underside of the leaves. The blisters contain white powdery spores which are spread by wind when released. Spores can be released at any time of day.", "Remedy": "Good hygiene practices should be used by growers and seedling production nurseries to help restrict movement of white blister. It is easily spread by wind-blown spores, which can make reducing infection difficult in a local area."}}, {"model": "datamodel.disease", "pk": 64, "fields": {"diseaseName": "White rust", "Symptoms": "White pustules on cotyledons, leaves, stems and/or flowers which coalesce to form large areas of infection; leaves may roll and thicken", "Remedy": "Rotate crops; plant only disease-free seed; apply appropriate fungicide if disease becomes a problem"}}, {"model": "datamodel.disease", "pk": 65, "fields": {"diseaseName": "Yellow rust", "Symptoms": "Mainly occur on leaves than the leaf sheaths and stem. Bright yellow pustules (Uredia) appear on leaves at early stage of crop and pustules are arranged in linear rows as stripes.\nThe stripes are yellow to orange yellow. The teliospores are also arranged in long stripes and are dull black in colour.\nThe pustules of stripe rust, which, contain yellow to orange-yellow urediospores, usually form narrow stripes on the leaves.", "Remedy": "Be sure to dispose of these leaves. Do not compost them. Then treat your plant with a fungicide, such as neem oil. Continue to remove leaves and treat the plant until all signs of the plant rust are gone."}}, {"model": "datamodel.disease", "pk": 66, "fields": {"diseaseName": "Fusarium wilt", "Symptoms": "symptoms include leaf chlorosis, stunting, and leaf drop.", "Remedy": "Test your soil and use a slow-release, organic fertilizer in the vegetable garden. Hand pull or spot treat weeds using a weed flamer or natural herbicide — many weed species host the disease pathogen. Mycostop is a biological fungicide that will safely protect crops against wilt caused by Fusarium."}}, {"model": "datamodel.disease", "pk": 67, "fields": {"diseaseName": "Damping off", "Symptoms": "Groups of seedlings may die in roughly circular patches, the seedlings sometimes having stem lesions at ground level. Stems of seedlings may also become thin and tough (\"wire-stem\") resulting in reduced seedling vigor. Leaf spotting sometimes accompanies other symptoms, as does a grey mold growth on stems and leaves. Roots sometimes rot completely or back to just discolored stumps", "Remedy": "Sowing seeds in a sterilized growing medium can be effective, although fungal spores may still be introduced to the medium, either on the seeds themselves or after sowing (in water or on the wind). To reduce survival of the pathogens, remove and discard diseased plants, and sterilize containers to remove dust, planting medium, and soil particles in which spores can survive. Maintaining drier conditions with better air circulation helps prevent the spread of the disease, although it can also prevent or slow down germination. Spraying or drenching the soil with a recommended anti-fungal treatment (such as copper oxychloride) also helps suppress the disease."}}, {"model": "datamodel.disease", "pk": 68, "fields": {"diseaseName": "Bacterial leaf blight", "Symptoms": "Watersoaked lesions move from tip downwards on the edges of leaves. Gradually symptoms turn into yellow and straw coloured stripes with wavy margins. In early morning in humid areas yellowish, opaque, turbid drops of bacterial ooze may be seen", "Remedy": "Remove collateral weed hosts from bunds and channels.\n Use only disease free seedlings.\n Avoid excess nitrogen."}}, {"model": "datamodel.disease", "pk": 69, "fields": {"diseaseName": "Mint rust", "Symptoms": "Small, dusty, bright orange, yellow or brown pustules on undersides of leaves; new shoots may be pale and distorted; large areas of leaf tissue die and leaves may drop from plant", "Remedy": "Infected plants and rhizomes should be removed to prevent spread; heat treatment of roots may help to control the disease; roots should be immersed in hot water at 44°C (111°F) for 10 minutes, cooled using cool water and then planted as usual"}}, {"model": "datamodel.disease", "pk": 70, "fields": {"diseaseName": "Black rot", "Symptoms": "Seedlings develop wilted yellow to brown leaves and collapse; yellow, V-shaped lesions on mature leaf margins; dark rings can be found in the cross section of the stem", "Remedy": "Primary control methods based on good sanitation; plant disease-free seed; rotate crops every 2 years or less to non-brassica; avoid sprinkler irrigation"}}, {"model": "datamodel.disease", "pk": 71, "fields": {"diseaseName": "Bacterial heart rot", "Symptoms": "Water-soaked lesions on the white basal sections of leaves in the central whorl which may spread to all leaves in the central whorl; midportions of leaves become olive green in color with a bloated appearance; infected fruits exude juices and the shell becomes olive green; cavities form within the fruit", "Remedy": "Remove and destroy infected fruits; avoid the use of infected crowns for seed material to prevent spread of the disease; planting to avoid flowering when adjacent field is fruiting can reduce disease development; use of miticides and control of ants can significantly reduce disease incidence"}}, {"model": "datamodel.disease", "pk": 72, "fields": {"diseaseName": "Fruit Rot", "Symptoms": "As the rot progresses the lesion expands, causing a slimy rot, and bacteria may ooze through cracks in the epidermis. Black Mold Rot -Causal Agent:Alternaria alternata and Stemphyfium species. Symptoms can range from superficial flecking to brown-black, dry, sunken lesions which may extend into fruit cavities.", "Remedy": "Spray Bavistin 1gm/litre of water one week before harvesting of fruit."}}, {"model": "datamodel.disease", "pk": 73, "fields": {"diseaseName": "Ergot", "Symptoms": "Small dark lesions on leaves which are usually oval in shape but may be oblong to rectangular; centers of lesions are gray to tan in color with visible black dots; lesions may be covered in spores during wet weather; lesions may also be present on the stems and are slightly longer than those on the leaves.", "Remedy": "Avoid planting millet varieties that are highly susceptible to Cercospora fungi; control weeds in field; rotate crops and practice good sanitation; no chemical control is needed to treat the disease."}}, {"model": "datamodel.disease", "pk": 74, "fields": {"diseaseName": "Rust", "Symptoms": "Small yellow or white raised spots on upper and lower leaf surfaces; spots tend to be more numerous on lower leaf surface; spots enlarge and develop into red-brown pustules which may be surrounded by a yellow halo.", "Remedy": "Plant resistant varieties of millet if rust is a persistent problem; avoid the use of overhead irrigation; do now plant millet in close proximity to eggplant or other Solanaceous crops; there are no recommended chemical controls for rust."}}, {"model": "datamodel.disease", "pk": 75, "fields": {"diseaseName": "Charcoal rot", "Symptoms": "The characteristic symptoms of the disease become apparent as the plants approach maturity. The disease generally appears early after flowering.A distinguishing character of the disease is the presence of the small black sclerotia in the pith of the affected stalks. Roots are also invaded and show black sclerotia in the disorganised tissue.", "Remedy": "Regular irrigations particularly during flowering time should be provided.\nUse resistant varieties like DHM 103, Ganga Safed - 2 and avoid sowing of suceptable varieties like DHM 105.\nSeed treatment with Carbendazim or Thiram 3g/kg seed is effective.\nField sanitation, crop rotation should be followed."}}, {"model": "datamodel.disease", "pk": 76, "fields": {"diseaseName": "Stem bleeding", "Symptoms": "Soft, yellow rot on trunk; affected areas are dark and turn black as they mature; a reddish-brown liquid may ooze from rotting regions and spill down trunk.", "Remedy": "Avoid wounding palms with machinery and tools to reduce disease incidence; disease can be controlled with applications of the fungicide benomyl where registered; infected trees should be removed and destroyed as soon as possible."}}, {"model": "datamodel.disease", "pk": 77, "fields": {"diseaseName": "Gray leaf blight", "Symptoms": "Small, yellow-brown spots on leaflets which develop gray centers and dark green borders; lesions coalesce to form large necrotic patches; tips of leaflets turning gray; canopy has blighted appearance.", "Remedy": "Disease usually only merits control in coconut nurseries as infection of mature coconut palms are rare; appropriate broad spectrum protective fungicides should be applied."}}, {"model": "datamodel.disease", "pk": 78, "fields": {"diseaseName": "Rice blast", "Symptoms": "On the leaves, the lesions start as small water soaked bluish green specks, soon enlarge and form characteristic boat shaped spots with grey centre and dark brown margin.The spots join together as the disease progresses and large areas of the leaves dry up and wither. Similar spots are also formed on the sheath.", "Remedy": "Use of seeds from a disease free crop\n Grow resistant varieties like  MTU 1010, Swathi, IR 64, IR 36, Jaya, Vijaya, Ratna,\n Remove and destroy the weed hosts in the field bunds and channels.\n Split application of nitrogen and judicious application of nitrogenous fertilizers\n Treat the seeds with Captan or Thiram or Carbendazim or Carboxin or Tricyclazole  at 2 g/kg."}}, {"model": "datamodel.disease", "pk": 79, "fields": {"diseaseName": "Brown Spot of Rice", "Symptoms": "Symptoms appear as lesions (spots) on the coleoptile, leaf blade, leaf sheath, and glumes, being most prominent on the leaf blade and glumes.\n\nThe disease appears first as minute brown dots, later becoming cylindrical or oval to circular. The several spots coalesce and the leaf dries up.", "Remedy": "Use disease free seeds.\nField sanitation-removal of collateral hosts and infected debris in the field.\nCrop rotation,\nAdjustment of planting time"}}, {"model": "datamodel.disease", "pk": 80, "fields": {"diseaseName": "grey mould", "Symptoms": "Fuzzy, grey, mould growths on any part of the chilli plant including stems, leaves, buds, flowers or fruit. This can be in spots or across the whole plant.\n\n Look out for tiny black seed-like structures in the infected part of the chilli plant.\n\n Chilli pods can go soft and brown instead of ripening.\n\n In severe infections, buds and flowers and indeed the whole plant can quickly shrivel and die.", "Remedy": "Remove dead and dying leaves, buds and flowers from your chillies immediately and do not leave dead plant material lying around.\n\n Grey Mould favours human conditions, so keep chilli greenhouses well ventilated and plants well spaced.\n\n Do not overwater chilli plants or leave water in greenhouses."}}]